#+title: Chapter 2 - Building Abstractions with Data

* Utility functions

#+begin_src scheme :session chapter2
(define (displayln object)
  (display object)
  (newline))

(define (displayln-all . objects)
  (for-each displayln objects))
#+end_src

#+RESULTS:
: #<unspecified>

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.1][Exercise 2.1]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
; From the text
(define (gcd a b)
  (if [= b 0]
      a
      (gcd b (remainder a b))))

(define (make-rat n d)
  (if (< d 0)
      (make-rat (- n) (- d))
      (cons n d)))

; Tests
(make-rat 5 4)
(make-rat -5 -4)
(make-rat 1 -2)
#+end_src

#+RESULTS:
: (5 . 4)
: (5 . 4)
: (-1 . 2)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.17][Exercise 2.17]]

#+begin_src racket :lang sicp  :session ch2 :results output  :exports both
(define (last-pair items)
  (if (null? (cdr items))
      items
      (last-pair (cdr items))))

; Tests
(last-pair (list 23 72 149 34))
#+end_src

#+RESULTS:
: (34)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.18][Exercise 2.18]]

We can reverse the list in a single pass by growing it "backwards"

(a (b (c))) -> ()
(b (c)) -> (a)
(c) -> (b (a))
() -> (c (b (a)))

#+begin_src racket :lang sicp  :session ch2 :results output  :exports both
(define (reverse items)
  (define (reverse-iter items reversed)
    (if (null? items)
        reversed
        (reverse-iter (cdr items) (cons (car items) reversed))))
  (reverse-iter items '()))

(reverse (list 1 2 3))
#+end_src

#+RESULTS:
: (3 2 1)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.19][Exercise 2.19]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
; From the text
(define (cc amount coin-values)
        (cond [(= amount 0) 1]
              [(or (< amount 0) (no-more? coin-values)) 0]
              [else
               (+ (cc amount
                      (except-first-denomination coin-values))
                  (cc (- amount
                         (first-denomination coin-values))
                      coin-values))]))

(define (no-more? coin-values)
  (null? coin-values))

(define (first-denomination coin-values)
  (car coin-values))

(define (except-first-denomination coin-values)
  (cdr coin-values))

; Tests
(define us-coins (list 50 25 10 5 1))
(cc 100 us-coins)
#+end_src

#+RESULTS:
: 292

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.20][Exercise 2.20]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (same-parity z0 . z)
  (define (same-parity-iter z)
    (cond [(null? z) z]
          [(= (modulo z0 2) (modulo (car z) 2)) (cons (car z) (same-parity-iter (cdr z)))]
          [else (same-parity-iter (cdr z))]))
  (cons z0 (same-parity-iter z)))

; Tests
(same-parity 1 2 3 4 5 6 7)
(same-parity 2 3 4 5 6 7)
#+end_src

#+RESULTS:
: (1 3 5 7)
: (2 4 6)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.21][Exercise 2.21]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (square x) (* x x))

(define (square-list items)
  (if (null? items)
      nil
      (cons (square (car items)) (square-list (cdr items)))))

; Tests
(square-list (list 1 2 3 4 5))
#+end_src

#+RESULTS:
: (1 4 9 16 25)

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (square x) (* x x))

(define (square-list items)
  (map square items))

; Tests
(square-list (list 1 2 3 4 5))
#+end_src

#+RESULTS:
: (1 4 9 16 25)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.22][Exercise 2.22]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (square x) (* x x))

; From the text
(define (square-list items)
  (define (iter things answer)
    (if (null? things)
        answer
        (iter (cdr things)
              (cons (square (car things))
                    answer))))
  (iter items nil))

; Tests
(square-list (list 1 2 3 4 5))
#+end_src

#+RESULTS:
: (25 16 9 4 1)

Let's step through this procedure with the test input =(list 1 2 3)=.

#+begin_src racket :lang sicp
(square-list '(1 2 3))
(iter '(1 2 3) nil)
(iter (cdr '(1 2 3)) (cons (square (car '(1 2 3))) nil)) -> (iter '(2 3) (cons (square 1) nil)) -> (iter '(2 3) '(1))
(iter (cdr '(2 3)) (cons (square (car '(2 3))) '(1))) -> (iter '(3) (cons (square 2) '(1))) -> (iter '(3) '(4 1))
(iter (cdr '(3)) (cons (square (car '(3))) '(4 1))) -> (iter nil (cons (square 3) '(4 1))) -> (iter nil '(9 4 1))
'(9 4 1)
#+end_src

Louis Reasoner is building his list "backwards" like our reverse function.
Reversing the order of the arguments to =cons= won't work, since =(cons nil ...)= does not produce a useful list.

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.24][Exercise 2.24]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(list 1 (list 2 (list 3 4)))
#+end_src

#+RESULTS:
: (1 (2 (3 4)))

Not drawing the box and pointer structure.

#+begin_src
1
 \
  2
 / \
3   4
#+end_src

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.25][Exercise 2.25]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define a '(1 3 (5 7) 9))
(define b '((7)))
(define c '(1 (2 (3 (4 (5 (6 7)))))))

(car (cdr (car (cdr (cdr a)))))
(car (car b))
(car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr c))))))))))))
#+end_src

#+RESULTS:
: 7
: 7
: 7

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.26][Exercise 2.26]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define x (list 1 2 3))
(define y (list 4 5 6))

(append x y)
(cons x y)
(list x y)
#+end_src

#+RESULTS:
: (1 2 3 4 5 6)
: ((1 2 3) 4 5 6)
: ((1 2 3) (4 5 6))

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.27][Exercise 2.27]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (deep-reverse items)
  (define (reverse-iter items reversed)
    (if (null? items)
        reversed
        (reverse-iter
         (cdr items)
         (cons (if [list? (car items)]
                   (deep-reverse (car items))
                   (car items))
               reversed))))
  (reverse-iter items '()))

(deep-reverse '((1 2) (3 4)))
#+end_src

#+RESULTS:
: ((4 3) (2 1))

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.28][Exercise 2.28]]

|       Subtree | Leaves    |
|---------------+-----------|
| ((1 2) (3 4)) | nil       |
|         (1 2) | nil       |
|             1 | (1)       |
|             2 | (1 2)     |
|         (3 4) | (1 2)     |
|             3 | (1 2 3)   |
|             4 | (1 2 3 4) |

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (fringe tree)
  (cond [(not (pair? tree)) tree]
        [(not (pair? (car tree))) (cons (car tree) (fringe (cdr tree)))]
        [else (append (fringe (car tree)) (fringe (cdr tree)))]))

(define x (list (list 1 2) (list 3 4)))
(fringe x)
(fringe (list x x))
#+end_src

#+RESULTS:
: (1 2 3 4)
: (1 2 3 4 1 2 3 4)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.29][Exercise 2.29]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (make-mobile left right)
  (list left right))

(define (make-branch length structure)
  (list length structure))

; Part A
(define (left-branch mobile)
  (car mobile))

(define (right-branch mobile)
  (car (cdr mobile)))

(define (branch-length branch)
  (car branch))

(define (branch-structure branch)
  (car (cdr branch)))

; Part B

(define (total-weight mobile)
  (define (branch-weight branch)
    (cond [(number? (branch-structure branch)) (branch-structure branch)]
          [else (total-weight (branch-structure branch))]))
  (+ (branch-weight (left-branch mobile))
     (branch-weight (right-branch mobile))))

; Part C
(define (torque branch distance)
  (cond [(null? branch)
         nil]
        [(number? (branch-structure branch))
         (* (branch-structure branch) distance)]
        [else
         (let ([left (left-branch (branch-structure branch))]
               [right (right-branch (branch-structure branch))])
           (- (torque left (- distance (branch-length left)))
              (torque right (+ distance (branch-length right)))))]))

(define (mobile-balanced? mobile)
  (= (torque (left-branch mobile) (- (branch-length (left-branch mobile))))
     (torque (right-branch mobile) (branch-length (right-branch mobile)))))
; Tests
(total-weight (make-mobile (make-branch 1 2) (make-branch 3 4)))
(total-weight (make-mobile (make-branch 1 (make-mobile (make-branch 1 2) (make-branch 3 4))) (make-branch 5 6)))

(define x0 (make-branch 0 1))
(define x1 (make-branch 1 1))
(define x2 (make-branch 1 (make-mobile (make-branch 1 1)
                                       (make-branch 1 1))))

(torque x0 0)
(torque x1 1)
(torque x2 1)

(mobile-balanced? (make-mobile x0 x0))
(mobile-balanced? (make-mobile x0 x1))
#+end_src

#+RESULTS:
: 6
: 12
: 0
: 1
: -2
: #t
: #f

For part D, I would just have to reimplement the selector procedures.

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.30][Exercise 2.30]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (square x) (* x x))

(define (square-tree tree)
  (map (lambda (sub-tree)
         (if [pair? sub-tree]
             (square-tree sub-tree)
             (square sub-tree)))
       tree))

; Tests
(square-tree
 (list 1
       (list 2 (list 3 4) 5)
       (list 6 7)))
#+end_src

#+RESULTS:
: (1 (4 (9 16) 25) (36 49))

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.31][Exercise 2.31]]

#+begin_src racket :lang sicp  :session  :results output  :exports both
(define (tree-map procedure tree)
  (map (lambda (sub-tree)
         (if [pair? sub-tree]
             (tree-map procedure sub-tree)
             (procedure sub-tree)))
       tree))

(define (square x) (* x x))
(define (square-tree tree) (tree-map square tree))

; Tests
(square-tree
 (list 1
       (list 2 (list 3 4) 5)
       (list 6 7)))
#+end_src

#+RESULTS:
: (1 (4 (9 16) 25) (36 49))

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.33][Exercise 2.33]]

#+begin_src scheme :session chapter2 :results output
; From the text
(define (accumulate op initial sequence)
  (if (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(define (map p sequence)
  (accumulate (lambda (x y) (cons (p x) y)) '() sequence))

(define (append seq1 seq2)
  (accumulate cons seq2 seq1))

(define (length sequence)
  (accumulate (lambda (x y) (+ y 1)) 0 sequence))

; Tests
(displayln-all
 (map (lambda (x) (* x x)) (list 1 2 3))
 (append (list 1 2 3) (list 4 5 6))
 (length (list 1 2 3 4 5)))

; Rebind old procedure definitions
(set! map (module-ref (resolve-module '(scheme base)) 'map))
(set! append (module-ref (resolve-module '(scheme base)) 'append))
(set! length (module-ref (resolve-module '(scheme base)) 'length))
#+end_src

#+RESULTS:
: (1 4 9)
: (1 2 3 4 5 6)
: 5

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.34][Exercise 2.34]]

#+begin_src scheme :session chapter2 :results output
(define (horner-eval x coefficient-sequence)
  (accumulate (lambda (this-coeff higher-terms) (+ this-coeff (* higher-terms x)))
              0
              coefficient-sequence))

(displayln-all
 (horner-eval 2 (list 1 3 0 5 0 1)))
#+end_src

#+RESULTS:
: 79

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.36][Exercise 2.36]]

This reminds me of Python's [[https://docs.python.org/3/library/functions.html#zip][zip()]] builtin

#+begin_src scheme :session chapter2 :results output
(define (accumulate-n op init seqs)
  (if (null? (car seqs))
      '()
      (cons (accumulate op init (map car seqs))
            (accumulate-n op init (map cdr seqs)))))

; Tests
(define s '((1 2 3) (4 5 6) (7 8 9) (10 11 12)))

(displayln-all
 (accumulate-n + 0 s))
#+end_src

#+RESULTS:
: (22 26 30)

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.37][Exercise 2.37]]

#+begin_src scheme :session chapter2 :results output
(define (dot-product v w)
  (accumulate + 0 (map * v w)))

(define (matrix-*-vector m v)
  (map (lambda (row) (dot-product row v)) m))

(define (transpose mat)
  (accumulate-n cons '() mat))

(define (matrix-*-matrix m n)
  (let ((cols (transpose n)))
    (map (lambda (row)
           (map (lambda (col)
                  (dot-product row col))
                cols))
         m)))

; Tests
(displayln-all
 (dot-product '(1 2 3) '(4 5 6))
 (matrix-*-vector '((1 2 3)
                    (4 5 6)
                    (7 8 9))
                  '(1 2 3))
 (transpose '((1 2 3)
              (4 5 6)
              (7 8 9)))
 (matrix-*-matrix '((2 0 0)
                    (0 2 0)
                    (0 0 2))
                  '((1 2 3)
                    (4 5 6)
                    (7 8 9)))
)
#+end_src

#+RESULTS:
: 32
: (14 32 50)
: ((1 4 7) (2 5 8) (3 6 9))
: ((2 4 6) (8 10 12) (14 16 18))

** [[https://mitp-content-server.mit.edu/books/content/sectbyfn/books_pres_0/6515/sicp.zip/full-text/book/book-Z-H-18.html#%_thm_2.38][Exercise 2.38]]

#+begin_src scheme :session chapter2 :results output
(use-modules (srfi srfi-1))
(displayln-all
 (fold-right / 1 (list 1 2 3))
 (fold / 1 (list 1 2 3))
 (fold-right list '() (list 1 2 3))
 (fold list '() (list 1 2 3))
)
#+end_src

#+RESULTS:
: 3/2
: 3/2
: (1 (2 (3 ())))
: (3 (2 (1 ())))

What property should =op= have? TODO revisit this

